In [4]:
import pandas as pd
items={'Year':pd.Series(data=[1990,1990,1990,1991,1991,1991,1992,1992,1992],index=[0,1,2,3,4,5,6,7,8]),'Name':pd.Series(data=['Alice','Bob','Charlie','Alice','Bob','Charlie','Alice','Bob','Charlie'],index=[0,1,2,3,4,5,6,7,8])}
Dataframe=pd.DataFrame(items)#creating a dataframe from dictionary...

In [5]:
Dataframe.insert(2,'Department',['HR','RD','Admin','HR','RD','Admin','HR','RD','Admin'])

In [6]:
Dataframe.insert(3,'Age',[25,30,45,26,31,46,27,32,28])

In [7]:
Dataframe.insert(4,'Salary',[50000,48000,55000,52000,50000,60000,60000,52000,62000])

In [8]:
Dataframe.head()#to get to know what type of data present...

   Year     Name Department  Age  Salary
0  1990    Alice         HR   25   50000
1  1990      Bob         RD   30   48000
2  1990  Charlie      Admin   45   55000
3  1991    Alice         HR   26   52000
4  1991      Bob         RD   31   50000

In [9]:
Dataframe.tail()

   Year     Name Department  Age  Salary
4  1991      Bob         RD   31   50000
5  1991  Charlie      Admin   46   60000
6  1992    Alice         HR   27   60000
7  1992      Bob         RD   32   52000
8  1992  Charlie      Admin   28   62000

In [10]:
Dataframe.groupby(['Year'])['Salary'].sum()

Year
1990    153000
1991    162000
1992    174000
Name: Salary, dtype: int64

In [11]:
Dataframe.groupby(['Name'])['Salary'].sum()

Name
Alice      162000
Bob        150000
Charlie    177000
Name: Salary, dtype: int64

In [12]:
Dataframe.groupby(['Year','Department'])['Salary'].sum()

Year  Department
1990  Admin         55000
      HR            50000
      RD            48000
1991  Admin         60000
      HR            52000
      RD            50000
1992  Admin         62000
      HR            60000
      RD            52000
Name: Salary, dtype: int64